

Feature: Вход в системата


  Scenario: Вход с валидни потребителски данни
    Given Потребителя отваря приложението
    When Въведе валидно потребителско име
    And въведе валдна парола
    And Кликне на логин бутона
    Then вижда съобщение за успешно влизане в системата
    
  Scenario: Вход без парола
   Given Потребителя отваря приложението
    When Въведе валидно потребителско име
    And Кликне на логин бутона
    Then вижда съобщение за липсваща парола
    
  Scenario: Вход без потребитеслко име
   Given Потребителя отваря приложението
    When въведе валдна парола
    And Кликне на логин бутона
    Then вижда съобщение за липсващо портребителско име
    
  Scenario: Вход с грешно име
   Given Потребителя отваря приложението
    When Въведе невалидно потребителско име
    And въведе валдна парола
    And Кликне на логин бутона
    Then вижда съобщение за грешно потребителско име
    
  Scenario: Вход с грешна парола
   Given Потребителя отваря приложението
    When Въведе валидно потребителско име
    And въведе невалдна парола
    And Кликне на логин бутона
    Then вижда съобщение за грешна парола